{
	"unknow":
	{
		"title":	"Unknown error",
		"details":	"The error code occurred there."
	},

	/* Errores principales */
	"example":
	{
		"title":	"Example error.",
		"details":	"This is an example of system errors BeatRock."
	},

	"setup.init":
	{
		"title":	"Setup - Failed on initial verification.",
		"details":	"Unable to complete the initial verification of the kernel.",
		"solution":	"Make sure your server meets the requirements for executing files BeatRock and fundamental to the work there."
	},

	"setup.config":
	{
		"title":	"Setup - Error in configuration file.",
		"details":	"A problem occurred while trying to load the configuration file.",
		"solution": "Make sure the configuration file exists, is not protected, damaged and your data are correct."
	},

	"bitrock.load.module":
	{
		"title":	"BitRock - Failure to load a module.",
		"details":	"Unable to load the specified module.",
		"solution":	"Make sure the module exists, not protected or damaged."
	},

	/* Errores de PHP */
	"php.code":
	{
		"title":	"PHP - Problem of execution.",
		"details":	"Apparently the application has run out of resources, the server has encountered a problem or part of the code has a syntax error."
	},

	"php.exception":
	{
		"title":	"PHP - There has been an exception.",
		"details":	"It has launched an exception in the code."
	},

	/* Errores de MySQL */
	"mysql.incomplete":
	{
		"title":	"MySQL - Incomplete information."
	},

	"mysql.connect":
	{
		"title": 	"MySQL - Connection failed.",
		"details":	"Unable to connect to the MySQL server.",
		"solution":	"Make sure the connection details are correct and that the MySQL server is on."
	},

	"mysql.need.connection":
	{
		"title":	"MySQL - You need an active connection.",
		"details":	"You attempted to execute a function that requires an active connection to MySQL server.",
		"solution":	"Because BeatRock makes a connection to start this error is considered rare. It is likely that your copy of BeatRock is modified or damaged."
	},

	"mysql.query":
	{
		"title":	"MySQL - Error during execution of a query.",
		"details":	"Unable to run a query on the MySQL server.",
		"solution":	"Make sure you have correctly written query, table, column and row there, and has not introduced special characters or SQL injection attempts."
	},

	"mysql.query.need":
	{
		"title":	"MySQL - Error during execution of a query.",
		"details":	"Failed to execute a query because of the lack of a resource.",
		"solution":	"This feature requires a SQL resource asset and it must specify the resource or make an inquiry before."
	},

	"mysql.engine":
	{
		"title": 	"MySQL - Motor invalid.",
		"details":	"Has indicated an invalid motor.",
		"solution": "Specify as MyISAM or InnoDB engine."
	},

	"mysql.recovery":
	{
		"title": 	"MySQL - Fails to load or restore the database",
		"details":	"An error occurred while trying to load or restore the database.",
		"solution":	"Make sure the database exists and is not damaged."
	},

	"mysql.query.novalid":
	{
		"title":	"MySQL - Invalid query.",
		"details":	"Unable to perform a special action for a consultation because it is invalid.",
		"solution":	"Make sure the information you want to run is valid for action, these actions usually only support queries like 'SELECT'."
	},

	/* Errores de FTP */
	"ftp.need":
	{
		"title":	"FTP - Connection not ready.",
		"details":	"You attempted to perform an action without having a connection FTP ready.",
		"solution":	"Set an FTP connection with the function 'Init'"
	},

	"ftp.connect":
	{
		"title":	"FTP - Connection failure.",
		"details":	"Unable to connect to the FTP server.",
		"solution":	"Make sure the connection details are correct and that the FTP server is on."
	},

	/* Errores de IO */
	"io.fail":
	{
		"title":	"IO - Failure in the system input and output files.",
		"details":	"There was an error related to writing or reading a file inside/outside.",
		"solution":	"Make sure the target file has the required permissions for the operation, whether or not damaged/protected."
	},

	/* Errores de GD */
	"gd.verify":
	{
		"title":	"Gd - Failed verification image type.",
		"details":	"Unable to detect the type of image you are working, make sure it is valid and that image is not damaged."
	},

	"gd.noexist":
	{
		"title":	"Gd - Failed to load the image.",
		"details":	"Unable to load the image correctly, make sure the image exists and is not damaged or protected."
	},

	"gd.filter":
	{
		"title":	"Gd - Invalid filter type.",
		"details":	"The filter specified for the image is invalid, you must select one of the following: negate, grayscale, EDGEDETECT, EMBOSS, MEAN_REMOVAL"
	},

	/* Errores de CURL */
	"curl.instance":
	{
		"title":	"cURL - Not being prepared any instance.",
		"details":	"You attempted to execute a function without having an instance of cURL connection ready.",
		"solution":	"Make a connection before the function 'Curl :: Init'"
	},

	/* Errores de Plantilla */
	"tpl.process":
	{
		"title":	"TPL - Failed to load the template.",
		"details":	"Unable to load the specified template.",
		"solution":	"Make sure the template file exists and is not damaged or protected."
	},

	"tpl.loadfiles":
	{
		"title":	"TPL - Failed to load the necessary files.",
		"details":	"Unable to load one or more internal files needed to load the template.",
		"solution": "Make sure the files as the header and footer exist and are not damaged or protected."
	},

	/* Errores de API Sociales */
	"social.service":
	{
		"title":	"Social - Service invalid.",
		"details":	"The service you want to use is invalid.",
		"solution":	"Make sure the service you have given is valid, like facebook or twitter"
	},

	"social.instance":
	{
		"title":	"Social - Not being prepared any instance.",
		"details": 	"You attempted to connect to a social service without preparing a request for it.",
		"solution":	"Register your application on page developer of the service you want to use and adjust the data to start an instance."
	},

	"social.instance.fail":
	{
		"title":	"Social - Failure in the preparation of an instance.",
		"details":	"An error occurred while trying to prepare a request for connection to the social API."
	},

	/* Errores de Memcache */
	"memcache.connect":
	{
		"title":	"Memcache - Connection failed.",
		"details":	"Unable to connect to the Memcache server.",
		"solution": "Make sure the connection data are valid and that the server is on."
	},

	"memcache.need.connection":
	{
		"title":	"Memcache - You need an active connection.",
		"details":	"You attempted to execute a function that requires an active connection to the server Memcache.",
		"solution":	"Because BeatRock makes a connection to start this error is considered rare. It is likely that your copy of BeatRock is modified or damaged."
	},

	"memcache.save":
	{
		"title": 	"Memcache - Failed to save.",
		"details":	"Unable to save data to the server Memcache."
	},

	/* Errores de Query */
	"query.prepare":
	{
		"title":	"Query - Failure in the preparation of a query.",
		"details":	"You attempted to execute a function deployment to the consultation but the instance of the same is not valid or has not been prepared.",
		"solution":	"Check that you have prepared a consultation of type 'SELECT', 'UPDATE', 'INSERT'"
	},

	"query.exec":
	{
		"title":	"Query - Error in query execution.",
		"details":	"You attempted to run a consultation when it has not been prepared.",
		"solution":	"Check that you have prepared a consultation of type 'SELECT', 'UPDATE', 'INSERT'"
	}
	
}